# 05: Membalik urutan baris dan kolom pada Data Frame

"Enjelita Meilinda - 2373037"
# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  3  7  4  1  7
1  1  7  9  4  7
2  6  3  3  8  5
3  1  7  7  3  5
4  7  9  7  4  3

# Membalik urutan kolom

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  7  1  4  7  3
1  7  4  9  7  1
2  5  8  3  3  6
3  5  3  7  7  1
4  3  4  7  9  7

# Membalik urutan baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  7  9  7  4  3
3  1  7  7  3  5
2  6  3  3  8  5
1  1  7  9  4  7
0  3  7  4  1  7

# Membalik urutan baris dan melakukan penyesuaian ulang index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  7  9  7  4  3
1  1  7  7  3  5
2  6  3  3  8  5
3  1  7  9  4  7
4  3  7  4  1  7